/* taskLib.h - VxWorks tasking library interface header */

/*
 * Copyright (c) 1988-2001, 2003-2017 Wind River Systems, Inc.
 *
 * The right to copy, distribute, modify or otherwise make use
 * of this software may be licensed only pursuant to the terms
 * of an applicable Wind River license agreement.
 */

/*
modification history
--------------------
01oct17,dlk  added rtpLockStopOnce member (V7COR-5367)
20may17,dlk  Replace 'pad3' field with new 'flags' field (F5593)
17oct16,h_k  added _WRS_INLINE_taskIdSelf option.
13apr16,h_k  updated for ARMv8 LP64 support. (F5261)
04aug16,cww  added documentation to VX_TASK to say that the stack sizes must be
             consistent when using static instantiation
10feb16,gvm  Allocate memory statically for names of tasks created
             with VX_TASK (V7SP-137)
20aug15,rr   Added note in VX_TASK() description to clarify static qualifier
             usage (V7COR-2470)
17aug15.h_k  added a VX_PRIVATE_UMASK comment. (V7COR-3479)
             removed VX_SMP_INTLOCKED macro.
27may15,zl   added resAllocCtx to TCB for core safety (F788)
24apr15,h_k  removed qTpPendNode and qTpIsPend that are no longer used.
             (V7COR-2851)
03apr15,txu  Added 'cmask' member to WIND_TCB to support umask (US55492)
05mar15,pad  Added certification considerations comment for 'IS_KERNEL_TASK'.
12dec14,h_k  removed deferredCpuSet field from WIND_SMP_INFO. (US48911)
20nov14,w_x  LP64 adaptation to support PPC64.(F2518)

	     extended maximum number of hooks to 10.
13may88,rdc  added signal info to tcbx.
28apr88,ecs  added IMPORTs of idle & taskName.
13apr88,gae  added function declarations; option bit VX_STDIO;
	     taskStd[] to TCB extension.
25jan88,jcf  written by extracting from vxLib.h v02l.
*/

#ifndef __INCtaskLibh
#define __INCtaskLibh

#include <vxWorks.h>
#include <vsbConfig.h>
#include <vwModNum.h>
#include <classLib.h>
#include <regs.h>
#include <excLib.h>
#include <private/qLibP.h>

#ifdef	_WRS_CONFIG_SV_INSTRUMENTATION
#include <private/eventP.h>
#endif	/* _WRS_CONFIG_SV_INSTRUMENTATION */

#include <private/semLibP.h>
#include <private/objLibP.h>
#include <private/eventLibP.h>
#include <private/msgQLibP.h>
#include <private/kernelBaseLibP.h>	/* kernelId for IS_KERNEL_TASK */
#include <stdlib.h>
#include <taskLibCommon.h>
#include <sys/taskDefs.h>
#include <vxAtomicLib.h>
#include <cpuset.h>

#ifdef	_WRS_INLINE_taskIdSelf
#include ARCH_HEADER(private/taskArchLibP.h)
#endif	/* _WRS_INLINE_taskIdSelf */

/*
 * logLib.h is included here to reduce the breakage of users who used to include
 * _func_logMsg via funcBindP.h
 */

#include <logLib.h>

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* miscellaneous */

#define TASK_PRIORITY_SELF	-1	/* passing normal Priority */

#define MAX_TASK_ARGS		10	/* max args passed to a task */

#define VX_MAX_TASK_SWITCH_RTNS	16	/* max task switch callout routines */
#define VX_MAX_TASK_SWAP_RTNS	16	/* max task swap callout routines */

/* The MAX priority (lowest priority) that a public task can have */

#define VX_TASK_PRIORITY_MAX    255

/* The MIN priority (highest priority) that a public task can have */

#define VX_TASK_PRIORITY_MIN	0


/* kernel only task option bits (see taskLibCommon.h for common option bits) */

#define VX_UNBREAKABLE		0x0002	/* breakpoints ignored */

#define VX_STDIO		0x0010	/* OBSOLETE: need not be set for stdio*/
#define VX_ADA_DEBUG		0x0020	/* 1 = VADS debugger support */
#define VX_FORTRAN		0x0040	/* 1 = NKR FORTRAN support */

#define VX_PRIVATE_CWD          0x0200  /* 1 = private CWD */

/* VX_PRIVATE_ENV		0x0080	   defined in taskLibCommon.h */
/* VX_NO_STACK_FILL		0x0100     defined in taskLibCommon.h */
/* VX_PRIVATE_UMASK		0x0400	   defined in taskLibCommon.h */
/* VX_TASK_NOACTIVATE		0x2000	   defined in taskLibCommon.h */
/* VX_NO_STACK_PROTECT		0x4000	   defined in taskLibCommon.h */

/* the following are now defined in sys/taskDefs.h */

/* #define VX_USER_MODE		0x0000	   INTERNAL: tasks in user mode */
/* #define VX_SUPERVISOR_MODE	0x0001	   INTERNAL: tasks in sup mode */
/* #define VX_DEALLOC_STACK	0x0004	   INTERNAL: deallocate stack */
/* #define VX_TASK_OBJ_OWNER	0x0800	   INTERNAL: task owns objs directly */
/* #define VX_DEALLOC_EXC_STACK	0x1000	   INTERNAL: deallocate the exc stack */
/* #define VX_DEALLOC_TCB	0x8000	   INTERNAL: deallocate the task TCB */

/* #define VX_FLAG_DELETION_ATTEMPT  0x00000001 INTERNAL: deletion attempt */

/* typedefs */

#ifndef	_ASMLANGUAGE

typedef struct
    {
    cpuset_t    affinity;       /* 0x00/0x00: CPU affinity (if any) */
    int         cpuIndex;       /* 0x04/0x04: CPU index running on (if any) */
    long	readyQExt;      /* 0x08/0x08: readyQ impl. specific extension */
    Q_HEAD      stateSaveQHead; /* 0x0c/0x10: stop queue head */
    UINT	stateRequest;	/* 0x1c/0x30: requested state change */
#ifdef	_WRS_CONFIG_LP64
    UINT	padding;	/* ----/0x34: padding  			*/
#endif	/* _WRS_CONFIG_LP64 */
    } WIND_SMP_INFO;		/* 0x20/0x38: total size */

/*
 * ############################# WARNING ###############################
 *
 * The WIND_TCB structure below will be moved into the private/taskLibP.h
 * header in the next major release of VxWorks. In future releases, direct
 * access to fields in the WIND_TCB structure will not be supported. Please
 * migrate to using the available published APIs in the task libraries
 * to access fields in the TCB.
 */

/*
 * INTERNAL: When adding fields to WIND_TCB, be sure to update the
 * offsets comments.  Also, the objCore and tickNode members must remain the
 * first and second of the structure.  This is because consistency is necessary
 * between the TCB and watchdog structures.
 */

typedef struct windTcb		/* WIND_TCB - task control block */
    {
    OBJ_CORE		objCore;	/* 0x00/0x00: object management */

    Q_NODE		tickNode;	/* 0x44/0x80: multiway q node: tick q */
    Q_NODE		qNode;		/* 0x54/0xa0: multiway q node: */
					/* 	      rdy/pend q */
    char *		pExcStackBase;	/* 0x64/0xc0: ptr to exc stack base */
    char *		pExcStackEnd;	/* 0x68/0xc8: ptr to exc stack end */
    char *		pExcStackStart; /* 0x6c/0xd0: ptr to start of exc */
					/* 	      stack */
    int			excCnt;		/* 0x70/0xd8: exception next cnt */

    UINT		status;		/* 0x74/0xdc: status of task */
    UINT		priority;	/* 0x78/0xe0: task's current priority */
    int			priNormal;      /* 0x7c/0xe4: normal running priority */
    UINT		lockCnt;	/* 0x80/0xe8: preemption lock count */

    /* SH arch. requires for the previous members to be within a 0x7f offset */

    UINT		priMutexCnt;    /* 0x84/0xec: # of inv safe sems a */
					/*	      task has 		   */
    UINT		priInheritCnt;  /* 0x88/0xf0: # of times task prio */
					/* 	      bumped 		   */
    int			priDrop;        /* 0x8c/0xf4: priority to drop task */
					/*	      to 		    */
    SEMAPHORE *		pPriMutex;      /* 0x90/0xf8: pointer to mutex task */
					/* 	      pends on 		    */

    RTP_ID		currentCtx;	/* 0x94/0x100: task's current context */
    RTP_ID		rtpId;		/* 0x98/0x108: real time process ID */

    void *		pUTcb;		/* 0x9c/0x110: ptr to user level TCB */
    int			options;	/* 0xa0/0x118: task option bits */
    UINT		tslice;		/* 0xa4/0x11c: current count of time */
					/*	       slice		     */
    Q_HEAD *		pPendQ;		/* 0xa8/0x120: q head pended on (if */
					/*	       any)		    */

    UINT16		swapInMask;	/* 0xac/0x128: task's switch in hooks */
    UINT16		swapOutMask;	/* 0xae/0x12a: task's switch out */
					/*	       hooks		 */

    UINT		safeCnt;	/* 0xb0/0x12c: safe-from-delete count */
    Q_HEAD		safetyQHead;	/* 0xb4/0x130: safe-from-delete q */
					/* 	       head 		  */

    FUNCPTR		entry;		/* 0xc4/0x150: entry point of task */

    char *		pStackBase;	/* 0xc8/0x158: points to bottom of */
					/* 	       stack 		   */
    char *		pStackEnd;	/* 0xcc/0x160: points to end of stack */
    void *		pEdrInfo;	/* 0xd0/0x168: ptr to ED&R info */

    int			errorStatus;	/* 0xd4/0x170: most recent task error */
#ifdef _WRS_CONFIG_LP64
    UINT32		flags;		/* ----/0x174: additional task flags */
#endif
    _Vx_exit_code_t	exitCode;	/* 0xd8/0x178: error passed to exit() */

    struct sigtcb *	pSignalInfo;	/* 0xdc/0x180: ptr to signal info for */
					/* 	       task 		      */
    struct selContext *	pSelectContext;	/* 0xe0/0x188: ptr to select info for */
					/*	       task 		      */

    _Vx_ticks_t		taskTicks;	/* 0xe4/0x190: total number of ticks */
    _Vx_ticks_t		taskIncTicks;	/* 0xe8/0x194: number of ticks in */
					/*	       slice 		  */

    struct taskVar *	pTaskVar;	/* 0xec/0x198: ptr to task variable */
					/*	       list 		    */
    struct rpcModList *	pRPCModList;	/* 0xf0/0x1a0: ptr to rpc module */
					/*	       statics 		 */
#if defined (_WRS_PAL_COPROC_LIB)
    struct coprocTblEntry * pCoprocTbl;	/* 0xf4/0x1a8: fpoint coprocessor */
					/*	       context 		  */
#else /* _WRS_PAL_COPROC_LIB */
    struct fpContext *	pFpContext;	/* 0xf4/0x1a8: fpoint coprocessor */
					/*	       context 		  */
#endif /* _WRS_PAL_COPROC_LIB */

    void *       	taskStdFp[3];	/* 0xf8/0x1b0: stdin,stdout,stderr */
					/*	       fps 		   */
    int			taskStd[3];	/* 0x104/0x1c8: stdin,stdout,stderr */
					/*		fds 		    */
    EVENTS		events;		/* 0x110/0x1d4: event info for the */
					/*		task 		   */
    int			nEnvVarEntries; /* 0x11c/0x1e0: num env vars used */
#ifdef _WRS_CONFIG_LP64
    UINT		pad4;		/* -----/0x1e4: explicit padding */
#endif

    size_t		envTblSize;	/* 0x120/0x1e8: number of slots in */
					/*		table 		   */
    char **		ppEnviron;	/* 0x124/0x1f0: environment var table */
    struct sm_obj_tcb *	pSmObjTcb;	/* 0x128/0x1f8: shared mem object TCB */
    void *		pComLocal;	/* 0x12c/0x200: COM task-local  */
					/*		storage ptr 	*/
    REG_SET *		pExcRegSet;	/* 0x130/0x208: exception regSet ptr */
					/*		or NULL		     */

    void *		pWdbInfo;	/* 0x134/0x210: ptr to WDB info */
					/*		-future use     */
    void *		pDbgInfo;       /* 0x138/0x218: ptr to DBG info */
					/*		-future use     */

    void *		pPthread;	/* 0x13c/0x220: ptr to pthread data  */
					/*		structs 	     */
    void *		pCompilerData;	/* 0x140/0x228: ptr to thread and EH */
					/*		data 		     */
    void *		pShellInfo;	/* 0x144/0x230: ptr to kernel shell  */
					/*		info 		     */
    MSGQ_TCB		msgQInfo;	/* 0x148/0x238: used for message     */
					/*		queues 		     */
    OBJ_ID		accessObjId;    /* 0x158/0x258: objId task is        */
					/*		accessing            */
    SEM_ID		taskVarSemId;	/* 0x15c/0x260: task variable mutex  */
    size_t		execGuardSize;  /* 0x160/0x268: execution stack guard */
					/*		size 		      */

    /* cpuTimeInfo should be aligned on an 8-byte boundary */

#ifndef _WRS_CONFIG_LP64
    UINT32		flags;		/* 0x164/ ----: additional task flags */
#endif

    UINT64              cpuTimeInfo[2]; /* 0x168/0x270: sched extension - CPU */
					/*		time 		      */

    void *              pPwrMgmtPState; /* 0x178/0x280: cpu pwr mgmt Task */
					/*		P-State 	  */

    /* extensions provided for plug-in schedulers */

    void *              pSchedInfo;     /* 0x17c/0x288: ptr to scheduler info */

    void *              pExecClkInfo;   /* 0x180/0x290: ptr to CPU-clock info */
    WIND_SMP_INFO       windSmpInfo;    /* 0x184/0x298: SMP info structure */

    long		reserved1;	/* 0x1a4/0x2d0: possible WRS 	*/
					/*		extension    	*/
    long		reserved2;	/* 0x1a8/0x2d8: possible WRS 	*/
					/*		extension    	*/
    long		spare1;		/* 0x1ac/0x2e0: possible user 	*/
					/*		extension 	*/
    long		spare2;		/* 0x1b0/0x2e8: possible user 	*/
					/*		extension 	*/
    long		spare3;		/* 0x1b4/0x2f0: possible user 	*/
					/*		extension 	*/
    long		spare4;		/* 0x1b8/0x2f8: possible user 	*/
					/*		extension 	*/

    /* ARCHITECTURE DEPENDENT */

#if (CPU_FAMILY==MC680X0)
    EXC_INFO		excInfo;	/* 0x1bc: exception info */

    /* REG_SET must be aligned on a 4 byte boundary */

    REG_SET		regs;		/* 0x1d0: register set */
    UINT16		foroff;		/* 0x218: format/offset from frame */
    UINT16		pad2;		/* 0x21a: pad format/offset to UINT */
#endif	/* CPU_FAMILY==MC680X0 */

#if (CPU_FAMILY==COLDFIRE)
    EXC_INFO		excInfo;	/* 0x1bc: exception info */

    /* REG_SET should be aligned on a 4-byte boundary */

    REG_SET		regs;		/* 0x1d0: register set */
#endif	/* CPU_FAMILY==COLDFIRE */

#if (CPU_FAMILY==MIPS)

    /* make excInfo on 8-byte boundary */

    EXC_INFO		excInfo;	/* 0x1bc: exception info */

    /* REG_SET should be on a 8-byte boundary */

    int			pad;		/* 0x1dc: pad format/offset to UINT */
    REG_SET		regs;		/* 0x1e0: register set */
#endif	/* CPU_FAMILY==MIPS */

#if (CPU_FAMILY == PPC)
    EXC_INFO		excInfo;	/* 0x1c0: exception info */
    ULONG		pCoprocCtx;	/* 0x1e0/0x340: pointer to Coprocessor */

    /* REG_SET must be aligned on a 4-byte boundary */

#ifndef	_WRS_CONFIG_LP64
    int                 pad;            /* 0x1ec: padding
					 * To be precise, only 4-byte alignment
					 * is required. However, we leave this
					 * padding for the offsets of other
					 * members to be compatible with VxWorks
					 * 6.9 in case kernel awareness host
					 * tools use hard coded offsets to
					 * access the TCB info.
					 */
#endif	/* !_WRS_CONFIG_LP64 */

    REG_SET		regs;		/* 0x1f0: register set */
#endif /* (CPU_FAMILY == PPC) */

#if (CPU_FAMILY == SPARC)
    EXC_INFO		excInfo;	/* 0x1bc: exception info */

    /* REG_SET must be aligned on an 8-byte boundary */

    REG_SET		regs;		/* 0x1d0: register set */
#endif	/* CPU_FAMILY == SPARC */

#if (CPU_FAMILY==SIMSPARCSOLARIS)
    EXC_INFO		excInfo;	/* 0x1bc: exception info */

    /* REG_SET must be aligned on an 8-byte boundary */

    int                 pad;            /* 0x1dc: padding for 8 bytes align */
    REG_SET		regs;		/* 0x1e0: register set */

#endif /* CPU_FAMILY==SIMSPARCSOLARIS*/

#if (CPU_FAMILY==SIMNT)
    EXC_INFO		excInfo;	/* 0x1bc: exception info */

    /* REG_SET must be aligned on a 4 byte boundary */

    REG_SET             regs;           /* 0x1d0: register set */
#if defined(_WRS_CONFIG_LP64) || !defined(_WRS_CONFIG_COMPAT69)
    SIM_REG_SET		extraRegs;
#endif /* _WRS_CONFIG_LP64 || !_WRS_CONFIG_COMPAT69 */
#endif /* CPU_FAMILY==SIMNT */

#if (CPU_FAMILY==SIMLINUX)
    EXC_INFO            excInfo;        /* 0x1bc: exception info */

    /* REG_SET must be aligned on a 4 byte boundary */

    REG_SET             regs;           /* 0x1d0: register set */
#if defined(_WRS_CONFIG_LP64) || !defined(_WRS_CONFIG_COMPAT69)
    SIM_REG_SET		extraRegs;
#endif /* _WRS_CONFIG_LP64 || !_WRS_CONFIG_COMPAT69 */
#endif /* CPU_FAMILY==SIMLINUX */

#if (CPU_FAMILY==I80X86)
    EXC_INFO            excInfo;        /* 0x1bc/0x300: exception info */
#ifdef _WRS_CONFIG_LP64
    UINT		padding;	/* -----/0x3ac: padding 	*/
#endif /* _WRS_CONFIG_LP64 */
    CTX_SET             ctxSet;         /* 0x214/0x3b0: ptr to extra context */

    /* REG_SET must be aligned on an 8-byte boundary for PENTIUM */

#ifndef _WRS_CONFIG_LP64
    int                 pad;            /* 0x224: padding for 8 bytes align */
#endif /* _WRS_CONFIG_LP64 */

    REG_SET             regs;           /* 0x228/0x3d0: register set */
#endif /* CPU_FAMILY==I80X86 */

#if (CPU_FAMILY==SH)
    EXC_INFO		excInfo;	/* 0x1bc: exception info */

    /* REG_SET must be aligned on a 4 byte boundary */

    REG_SET		regs;		/* 0x1d0: register set */
#endif	/* CPU_FAMILY==SH */

#if (CPU_FAMILY==ARM)
    EXC_INFO		excInfo;	/* 0x1bc/0x300: exception info */

    UINT32		fpStatus;	/* 0x1cc/0x328: fp status word */

#ifdef	_WRS_CONFIG_LP64
    int			pad[1];		/*       0x32C: padding */
#else
    /* REG_SET must be aligned on a 4-byte boundary */

    int                 pad[2];         /* 0x1d0: padding
					 * To be precise, only 4-byte alignment
					 * is required. However, we leave this
					 * padding for the offsets of other
					 * members to be compatible with VxWorks
					 * 6.9 in case kernel awareness host
					 * tools use hard coded offsets to
					 * access the TCB info.
					 */
#endif	/* _WRS_CONFIG_LP64 */

    REG_SET		regs;		/* 0x1d8/0x330: register set */
#endif /* CPU_FAMILY==ARM */

#if !defined (_WRS_PAL_COPROC_LIB)
    struct dspContext *	pDspContext;	/* dsp coprocessor context */
#else /* _WRS_PAL_COPROC_LIB */
    void *		pUnused;
#endif /* _WRS_PAL_COPROC_LIB */
    void *		pIpcomInfo;     /* ipcom info */
    struct tls_desc *	pTlsDesc;	/* TLS descriptor */
    void *		pVxdbgInfo;	/* target debug info */
    UINT                stopClients;  	/* taskStop clients */
    UINT                sigStopCnt;  	/* signal stop count */
    Q_HEAD  		waitPendQ;      /* pend queue for taskWait */
    void *              pCwdInfo;       /* CWD info */
    RTP_ID		rtpWaitId;	/* These two members are used for  */
    int			rtpExitStatus;  /* the rtpWait feature.  They hold */
                                        /* the RTP ID and exit status of   */
                                        /* RTP it is pending on.	   */
