/* objLibP.h - private object management library header */

/*
 * Copyright (c) 1992-1993, 2003-2016 Wind River Systems, Inc.
 *
 * The right to copy, distribute, modify or otherwise make use
 * of this software may be licensed only pursuant to the terms
 * of an applicable Wind River license agreement.
 */

/*
modification history
--------------------
08nov16,h_k  replaced vxAtomic32Add(), Sub(), Or() calls with inline functions.
15jun16,ajt  Removed extern void objShowInit (V7COR-2194)
25nov15,h_k  cleaned up static analysis warning for parameter_hidden. 
03jun15,h_k  added access and reference count macros.
             added objHandleAndClassToObjId(). (F3937)
26jan15,h_k  added INTLOCKED_KERNEL_STATE VSB option. (US41383)
21oct14,h_k  added kernel object access control support. (F2160)
21feb14,wzc  remove building warnings.(WB4-2765)
12sep13,dee  cleanup static analysis defects WIND00433361
03jun13,wzc  Added WIND_OBJ_STACKTRACE for system viewer.
09jul12,wzc  WIND00361531 - Remove building warnings.
24apr12,jpb  Added declaration of objRoutineNameGet().
11jan11,gls  fixed objVerifyAndProtect and objUnprotect when
             _WRS_CONFIG_OBJECT_VERIFICATION not defined (WIND00247724)
13oct10,jpb  Added sizeof OBJ_CORE to offset comments
17sep10,gls  added alignment to OBJ_ALLOC_FUNC
02sep10,jpb  Added function pointer *_func_objRtpObjEachHook.
16aug10,cww  Use dynamically generated offsets in offset macros
17feb10,pch  small footprint

07jun05,yvp  Updated copyright. #include now with angle-brackets.
02jun05,yvp  Reworked OBJ_VERIFY conditional for MKL.
25mar05,job  OBJ_VERIFY only defined in checked build
05may05,gls  added objShowInit()
07apr05,gls  added objOwnershipInit() (SPR #106150)
24jan05,aeg  added objRtpLibInit() function prototype (SPR #106381).
01feb05,kk   moved objOwnerGet(), objHandleShow(), objHandleTblShow()
	     to objLib.h
07sep04,dcc  added accessCnt to OBJ_CORE.
14sep04,lei  moved objOwnerSet() prototype to objLib.h
28sep04,fr   removed objCreateRtn from objOpen (SPR 101349)
16aug04,dcc  added _objClose() prototype.
16jul04,aeg  added objArchLibInit() function prototype, and changed
	     OBJ_VERIFY() to invoke arch specific objVerify() (SPR# 98168).
05jul04,dcc  added handle table growing support.
05may04,cjj  added objIdToObjHandle() definition.  Removed I960
	     preprocessor directives.
29apr04,dcc  added objRtpIdToObjHandle() definition.
09mar04,dcc  added WIND_OBJ_NAMED and WIND_OBJ_DELETE_ON_LAST_CLOSE
	     attributes. Moved objNameSet(), objOwnerGet(), and
	     objOwnerSet() prototypes from objLib.h
04feb04,dcc  added reference counter to OBJ_CORE.
06jan04,dcc  added OBJ_IS_REFERENCED macro
26nov03,dcc  updated definition of OBJ_HANDLE
31oct03,dcc  implemented modifications from code review.
11sep03,dcc  added objHandleList member to the OBJ_CORE structure, and
	     added handle table management support.
21aug03,dcc  removed WIND_OBJ_DISTRIBUTED and WIND_OBJ_SHARED flags. Added
	     objOpen() prototype.
05apr03,to   replace PD with RTP
14mar03,dcc  ported from AE1.1
15oct93,cd   added #ifndef _ASMLANGUAGE.
10dec93,smb  removed objHelp
22sep92,rrr  added support for c++
04jul92,jcf  extracted from v1j objLib.h.
*/

#ifndef __INCobjLibPh
#define __INCobjLibPh

#include <vxWorks.h>
#include <vsbConfig.h>
#include <dllLib.h>
#include <objLib.h>
#include <classLib.h>
#include <private/handleLibP.h>
#include <private/intMicroLibP.h>

#ifndef _ASMLANGUAGE
#include <stdarg.h>
#endif	/* _ASMLANGUAGE */

#ifdef _WRS_CONFIG_SMP
#include <vxAtomicLib.h>
#include <private/vxSmpP.h>
#include <private/kernelLockLibP.h>
#endif /* _WRS_CONFIG_SMP */

/* object attributes */

#define WIND_OBJ_NAME_DYNAMIC  0x01	/* object name dynamically allocated */
#define WIND_OBJ_DEALLOC_MEM   0x02	/* free object memory on destroy */
#define WIND_OBJ_INSTRUMENTED  0x04	/* WindView instrumented object */
#define WIND_OBJ_DELETE_ON_LAST_CLOSE 0x08  /* object will be deleted on the */
					    /* last close even if it is not */
					    /* previously unlinked */
#define WIND_OBJ_ORPHANED      0x10	/* unable to reclaim object */
#define WIND_OBJ_NO_RECLAIM    0x20	/* automatic reclamation disabled */
#define WIND_OBJ_PUBLIC	       0x40	/* object is public */
#define WIND_OBJ_NAMED	       0x80	/* object is named */
#define WIND_OBJ_DELETED       0x100    /* object is deleted */
#define WIND_OBJ_STACKTRACE    0x200	/* WindView stacktrace object events */

#ifndef _ASMLANGUAGE

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

typedef struct wind_obj		/* OBJ_CORE */
    {
    HANDLE		handle;		/* 0x00/0x00: handle */
    DL_LIST		ownerList;	/* 0x10/0x18: list of owned objects */
    DL_NODE		ownerNode;	/* 0x18/0x28: owner list node */
    DL_NODE		classNode;	/* 0x20/0x38: class list node */
    struct wind_obj *	ownerId;	/* 0x28/0x48: pointer to obj owner */
    RTP_ID		ownerRtpId;	/* 0x2c/0x50: object owner's RTP */
    char *		name;		/* 0x30/0x58: object name */
    struct wind_class *	pObjClass;	/* 0x34/0x60: pointer to obj class */
    DL_LIST		objHandleList;	/* 0x38/0x68: list of handles */
    UINT16		refCnt;		/* 0x40/0x78: reference counter */
    UINT16		accessCnt;	/* 0x42/0x7a: access counter */
#ifdef _WRS_CONFIG_LP64
    UINT32		padding;	/* ----/0x7c: explicit padding */
#endif	/* _WRS_CONFIG_LP64 */
    } OBJ_CORE;				/* 0x44/0x80: sizeof OBJ_CORE */


/*
 * Handles are constructed from three fields: handle index, generation 
 * count, and a reserved bit.
 * 
 * Handles are stored in a two-level table structure: a master table with
 * OBJ_MASTER_TBL_SIZE number of entries entries (populated as needed) 
 * pointing to the second-level handle tables with OBJ_HANDLE_TBL_SIZE 
 * number of entries.
 * 
 * The maximum number of handles is OBJ_HANDLE_INDEX_CNT.
 *
 * OBJ_INDEX_GET() macro returns the handle index
 * OBJ_ENTRY_INDEX_GET() macro returns the index in the second-level table
 * OBJ_TABLE_INDEX_GET() macro returns the index in the master table
 */

#define OBJ_HANDLE_INDEX_BITS	16	/* bit count for handle index */
#define OBJ_HANDLE_GEN_BITS	15	/* bit count for generation nunmber */
