/****************************************************************************************
 파 일 명 : kpisr.c
 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 목    적 : 기본 타스크 생성 및 초기화 처리
 가    정 :
 저 자 명 : 조철희
 변 경 자 :
 변경내용 : (목적)
 변경일시 : 99-06-25 3:10오후
 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 입력정의 :
 출력정의 :
 관련모듈 :
 자료구조 : (전역변수)
 에러처리/복귀순서:
 컴파일 일시 :
*****************************************************************************************/

#include "../INC/_common.h"
#include "../BSP/sbc_str.h"

extern LOCAL_INTR  gIsrFlag;       // in sbc_str.h
extern word32      gTic1Counter;
extern word32      gTic2Counter;

word32 gKDMFifoFull;
word32 gKDMHalfFull;

// extern UINT			gOverToaFlag;

/****************************************************************************************
 함    수 : ISR_tic1
 목    적 : Timeout for collecting PDW
 가    정 :
 저 자 명 : 조철희
 변 경 자 :
 변경내용 : (목적)
 변경일시 : 99-06-25 5:41오후
 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 입력정의 :
 출력정의 :
 관련모듈 :
 자료구조 : (전역변수)
 에러처리/복귀순서:
*****************************************************************************************/
//////////////////////////////////////////////////////////////////////
// vxworks 및 tvme8240 보드로 적용하기 위한 수정 작업
#ifdef _VXWORKS_
void ISR_tic1( timer_t ti, int arg )
#else
interrupt void ISR_tic1()
#endif
//////////////////////////////////////////////////////////////////////
{
#ifdef _VXWORKS_

#else
    // word32          *bdc_ptr;
    BD_WD_TT_CTRL   bdc;
    // int             errPst;
 
    gIsrFlag.b.TIC1 = true;
    gTic1Counter = (gTic1Counter == 99999999L ? 0L : gTic1Counter+1);

    bdc.word  = *(word32 *)(aLCSR + 0x60);          // 98.9.23
    bdc.b.tt1.EN   = false;         /* stop timer */
    *(word32 *)(aLCSR + 0x60) = bdc.word;
 
		stOverToaFlag = _spTrue;	
//	longjmp( gBeforeCol, _spTrue );

    /* Clear this interrupt */
    *(word32 *)(aLCSR + 0x74) = (word32)(1<<24);
#endif

}

/****************************************************************************************
 함    수 : ISR_tic2
 목    적 : CBIT
 가    정 :
 저 자 명 : 조철희
 변 경 자 :
 변경내용 : (목적)
 변경일시 : 99-06-25 5:41오후 
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 입력정의 :
 출력정의 :
 관련모듈 :
 자료구조 : (전역변수)
 에러처리/복귀순서:
*****************************************************************************************/
//////////////////////////////////////////////////////////////////////
// vxworks 및 tvme8240 보드로 적용하기 위한 수정 작업
#ifdef _VXWORKS_
void ISR_tic2( timer_t ti, int arg )
#else
interrupt void ISR_tic2()
#endif
//////////////////////////////////////////////////////////////////////
{
#ifdef _VXWORKS_

#else
  // word32      *bdc_ptr;
  BD_WD_TT_CTRL    bdc;

  gIsrFlag.b.TIC2 = true;
  gTic2Counter = (gTic2Counter == 99999999L ? 0L : gTic2Counter+1);
//  gIsrTmOutNpdw = _spTrue;                        // 99.05.02, deleted comment !

  bdc.word  = *(word32 *)(aLCSR + 0x60);          // 98.9.23
  bdc.b.tt1.EN   = false;         /* stop timer */
  *(word32 *)(aLCSR + 0x60) = bdc.word;

  /* Clear this interrupt */
  *(word32 *)(aLCSR + 0x74) = (word32)(1<<25);
#endif

}

/****************************************************************************************
 함    수 : ISR_dmFifoFull
 목    적 : 모든 IPL의 FIPL 구성
 가    정 :
 저 자 명 : 조철희
 변 경 자 :
 변경내용 : (목적)
 변경일시 : 99-05-26 5:41오후
 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 입력정의 :
 출력정의 :
 관련모듈 :
 자료구조 : (전역변수)
 에러처리/복귀순서:
*****************************************************************************************/
void ISR_dmFifoFull(void) {
	STR_TSK_MSG					tskMsg;

  gKDMFifoFull = _spTrue;

	tskMsg.hd.whcDev = _inPRC;
	tskMsg.in.opCode = MfifoFull;
	Qpost( SQ_MngTsk, tskMsg );

}

/****************************************************************************************
 함    수 : ISR_dmHalfFull
 목    적 : 모든 IPL의 FIPL 구성
 가    정 :
 저 자 명 : 조철희
 변 경 자 :
 변경내용 : (목적)
 변경일시 : 99-05-26 5:41오후
 ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 입력정의 :
 출력정의 :
 관련모듈 :
 자료구조 : (전역변수)
 에러처리/복귀순서:
*****************************************************************************************/
void ISR_dmHalfFull(void) {
	STR_TSK_MSG				 tskMsg;

  gKDMHalfFull = _spTrue;

	tskMsg.hd.whcDev = _inPRC;
  tskMsg.in.opCode = MhalfFull;
  Qpost( SQ_MngTsk, tskMsg );			// debug, 99-12-22 15:19:24

}

